{
	"name": "Egypt",
	"languages": ["Arabic"],
	"theme": {
		"bg_color": "#EFCF83",
		"col_1": "#624B1C",
		"col_2": "#54786A"
	},
	"flag": 		"https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Flag_of_Egypt.svg/300px-Flag_of_Egypt.svg.png",
	"anthem": 		"https://nationalanthems.info/eg.mp3",
	"capital": 		"Cairo",
	"population": 	"",
	"area": 		"1,001,00 KM Squared",
	"currency" : {
		"name": 	"Egyptian Pound",
		"img": 		""},
	"neighbours": {
		
		"north": [{"name": "Red Sea"}],
		"south": [{"name": "Sudan","flag": ""}],
		"east":  [{"name": "Palestine","flag": ""},{"name": "KSA","flag": ""}],
		"west":  [{"name": "Libya","flag": ""}]
	},
	"weather": {
		
		"summer": {	"content": "Summer Is Hot In Egypt, Temprature Could Reach 45 C In August",
					"icons": [],
					"img": "https://images.unsplash.com/photo-1539768942893-daf53e448371?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1171&q=80"},
					
		"winter": {	"content": "Cloudy With Some Chances For Rainfalls, Temprature Could Reach Below 20 C",
					"icons": [],
					"img": "https://images.unsplash.com/photo-1645804252805-1f9f3605b563?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1115&q=80"},
					
		"spring": { "content": "Mostly Sunny, Sometimes There Could Be Minor Sandy Storms",
					"icons": [],
					"img": "https://images.unsplash.com/photo-1595979904086-471704dc0e81?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=687&q=80"},
					
		"automn": { "content": "Windy and Rainy Yet Still Warm",
					"icons": [],
					"img": "https://images.unsplash.com/photo-1502640403806-cf2ac7a5d37a?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1170&q=80"},
					
		"summary": "The Average Weather In Egypt Is Sunny and Cool, However It May Be Very Hot In The South"
	},
	"food": [
	
		{
			"title": "Koshary",
			"img": "https://images.pexels.com/photos/9133003/pexels-photo-9133003.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
			"content": "a Mixture Of Rice, Macaroni, Lentils, Chickpeas, Fried Onions and a Special Egyptian Red Sauce, Very Popular Dish Amoung All The Egyptians"
		},
		{
			"title": "Tarb ( Grilled Kofta Wrapped In Lamb Fat)",
			"img": "",
			"content": "'Kofta' Is Made Of Minced Meat, Onion and a Bit Of Minced Fat, This Mixture Get Wrapped In Lamb Fat and Grilled"
		},
		{
			"title": "Molokhiya",
			"img": "",
			"content": "Is Made From Shredded Green Leaves Named 'Molokhiya', Mixed With Garlic and Spices, Often Served With Meat, Chicken and Even Rabbits"
		},
		{
			"title": "Mahshy ( Stuffed Veggies )",
			"img": "",
			"content": "Different Kind Of Veggies Stuffed With Rice and Mixture Of Vegetables and Spices"
		},
		{
			"title": "Hawawshi ( Meat Sandwich )",
			"img": "",
			"content": "Minced Meat Stuffed Inside Egytian Bread, Buttered and Then Baked"
		},
		{
			"title": "Macarona Bechamel ( Baked Pasta )",
			"img": "",
			"content": "a Meal Consists Of 3 Layers, First Boiled Pasta In the Bottom, Minced Beef and Often Other Stuff, and Finally The Bechamel ( a Delicious White Sauce )"
		},
		{
			"title": "Feseekh ( Fermented and Salted Fish )",
			"img": "",
			"content": "an Ancient Meal Came Back From Ancient Pharaohs Time, Served With Green Onions and Egyptian Bread, This Meal May Vary From Person to Another, Some Find It Delicious and Some Don't"
		},
		{
			"title": "Konafa",
			"img": "",
			"content": "Popular Dessert For The Egyptians, Specially In The Holy Month Of Ramadan, Consists Of Long Threads Of Vermicelli-like Dough and It Came With Many Different Additions ( Nutella, Mangoes, Nuts and Milk, Many More )"
		}
	],
	"landmarks": [
	
		{
			"title": "Pyramids Of Giza",
			"img": "",
			"content": "One Of The Oldest and Major Landmarks In The World, It Was Built 7000 Years Ago, Made By Limestone",
			"location": "Giza"
		},
		{
			"title": "Abu Simbel Temples",
			"img": "",
			"content": "Built For King Ramesses II and His Wife, Was Built In The 13th Century B.C.",
			"location": "Near Aswan"
		},
		{
			"title": "Valley Of The Kings",
			"img": "",
			"content": "Built Between 1539 and 1075 B.C., Include 62 Tombs For Kings and Queens",
			"location": "Luxor"
		},
		{
			"title": "Mosque Of Muhammed Ali",
			"img": "",
			"content": "Located In The Citadel Of Cairo, Established In Around 1830 To 1848, Was Built For The Memory Of Muhammed Ali's Son ( Tusun Pasha )",
			"location": "Cairo"
		},
		{
			"title": "Khan El-Khalili",
			"img": "",
			"content": "a Popular Old Bazar In Old Cairo, Established In 14th Century, The Location Itself Includes Some Famous Landmarks Such as El-Hussien Mosque and El-Fishawi Cafe The Oldest Cafe In Egypt 1797",
			"location": "Cairo"
		},
		{
			"title": "Saint Catherine's Monastery",
			"content": "Constructed In 500 AD, On Top Of a Moutain In Sinai, a Holy Christaine Place Visited By Thousands Of People",
			"img": "",
			"location": "Sinai"
		},
		{
			"title": "Citadel Of Qaitbay",
			"img": "",
			"content": "Built On The Same Location Of The Old Alexandrian Lighhouse, Was Made To Protect The City From Ottoman Empire Threats",
			"location": "Alexandria"
		},
		{
			"title": "Temple Of Philae",
			"img": "",
			"content": "Located In a Small Island In Aswan, Was Built In 280 B.C., The Location Was Saved From Floods Thanks To The Great Dame Of Aswan, UNISCO and The Egyptian Government",
			"location": "Aswan"
		}
	],
	"history": [
	
		{
			"title": "Pre-History",
			"content": "This Period Of Time Is Uncertain and We Are Not Sure When It Was Started When Man Kind Seatled On The Sides Of The Nile, People Back Then Were Hunters, Gathers and Fishermen, Life By That Time Was Centered Around The Nile River. The Egytians Then Were Divided Into Northern and Sourthern, Some Vessels Were Found Which Was Dated To About 3200 B.C. That Belongs To The Southerns.",
			"year": "?? - 3150 B.C.",
			"img": ""
		},
		{
			"title": "Dynastic Egypt",
			"year": "3150 B.C. - 332 B.C.",
			"img": "",
			"content": "This Is The Period When Egyptian Civilaztion Begins, Starting By a Unity Between The Northerns and Southerns By King ( Menes ), He Became The First King To Rule All Egypt, Making ( Tiba ) His Capital, This Is Consuderer The Peak Era In The Egyptian History and Especially During The Region OF Pharaoh Amenemhat III, This Era Was Divided Into Three Periods ( Old kingdom ), ( Middle Kingdom ) and ( New Kingdom ). Egyptians Start Using The ( Hieroglyphics ) a Form Of Writing That Used Images - Probably The First Known Alphabatical -, Making New Methods and Ways To Organize and Manage Lands and Foods, New Methods and Tools Were Made To Help In Agricultural Such as Canals and Levees, Begun To Build Cities, Tombs and Major Buildings, The Great Pyramids In Giza Was Built In The Old Kingdom, They Were Not The First Neither The Last To Be Built, Egyptian Built Boats For Trading With Other Nations Around, In Around 1650 B.C. The Hyksos Invaded Egypt, It Was The End Of The Middle Kingdom. The New Kingdom Started With The Explusion Of The Hyksos From Egypt, However It's End In 332 B.C. When Alexander The Great Conquered It"
		},
		{
			"title": "Greek and Roman Egypt",
			"year": "332 B.C. - 639 A.C.",
			"img": "",
			"content": "After Alexander Death His Empire Split Into Parts, It's When Greek General Called Ptolemy Eventually Took Egypt and For About 300 Years His Greek Descendeants Ruled Egypt However In 30 B.C. Egypt Became a Province Of The Roman Empire and Ceased To Be an Independent Empire and It Happened To Be Splited Into Two, Egypt Was Part Of The Eastern Half, Known To Us as The Byzantine Empire, Importing Christianity To Egypt, However This Era Came To an End When Muslims Conquered It In 639"
		},
		{
			"title": "Arabian Era",
			"year": "639 - 1517",
			"img": "",
			"content": "Egypt Had Become Part Of an islamic Empire and Was Ruled By Baghdad, However In 868 and Administrator Called Ahmed Ibn Tulun Declared Egypt Independent But Independence Did Not Last Long, His Son and Successor Was Assassinated. In 969 Egypt Was Conquered By The Fatimids Of Tunisia, The Fatimids Ruled Egypt Until 1171 and They Built Cairo, Which Became The Capital Till Our Time, By That Time ( Salah al din ) Known In The West as ( Saladin ) Became Ruler Of Egypt, He Founded a Dynasity Called The Ayyubids Who Ruled Egypt For Nearly 80 Years. Then The Country Was Ruled By Mamluks Until 1517, This Period Of Time Was Known For Egypt as a Rich and Powerful Era However It Was Over When The Ottoman Turks Conquered Egypt"
		},
		{
			"title": "Ottomons and Mohamed Ali's Era",
			"year": "1517 - 1952",
			"img": "",
			"content": "Ottomons Ruled Egypt For Almost 400 Years, It was a Peaceful Time As Both Nations -( Egypt ) & The ( Ottomons )- Were Muslims. In 1798 a French Army Led By Napoleon Landed At Egypt First In Alexandria, However Napoleon Abandoned His Army and Left Egypt, After That The Ottomons and French Both Fought The French The Forced Them Out Of The Country, By That Time The Country Was Under The Mumluks Power, However a Man Called ( Mohammed Ali ) Became The Ruler Of Egypt and Sudan, He Invited All Mumluks To His Castle and Then Order To Kill Them, Mohamed ali's Period Was Considered a Rise, Factories and Shipyards Were Built Amoung Other Economical Upgrades, However He Died In 1849, and As He Was The King Of Egypt The Ruler Was One Of His Sons. After That Egypt Was More Modernized By His Incestors Like ( Khedive Ismail ) Who Made Postal Service and Railways and Ofcourse The Suez Canal, This Great Period Of Time Eventually Ended With The British Army Invading Egypt In 1882 For Obvious Reasons, Kepping The Khedive - The King - as a Puppet Ruler. After The First World War British Began To Lose Control Over It's Territories and Eventually Dividing The Ariabian Area Into What We See Now On The Map and They Declared Egypt as an Independent State and Finally Withdrawn From Egypt In 1947. In "
		},
		{
			"title": "Modern History",
			"year": "1952 - Present",
			"img": "",
			"content": "In 1948 Things Were Getting Out Of Hand For King Farouk When He Lost Fighting Against The Invasion If Palestine, In 1952 a Group Of Officers Decided To Overthrowing King Farouk and They Changed The Rulling System To Republic, For The Next Six Decades 4 Presidents Came - all From The Military - First ( Mohamed Naguib ), Then ( Gamal Abd-elnasser ) Who Had Finished Building The Great Dam In Aswan, Nationalizing Suez Canal, However He Had Lost All Battles In His Era and ( Anwar El-sadat ) Was Incharge In 1970 When ( Gamal Abd-elnasser ) Was Poisoned, ( Anwar El-saddat ) Was Well Known For Winning War Against ( Israel ) Which Had Conquered Sinai In 1967, In 1973 Egypt, Syria and Other Arabian and Islamic Countries Stood Together Against ( Israel ), Brining Back All The Lands In Sinai In 1982, However He Also Had Been Assassinated, After Him ( Hosney Mubark ) Was The President For 30 Years Starting From 1981 Until 2011 When He Left During The Egyptian Revolution In 25 January 2011"
		}
	],
	"facts": [
		"Egyptians are First To Discover Paper and Ink",
		"There're Around 130 Pyramids In Egypt",
		"Egyptians Invented the 365-day Calendar",
		"Bandages Of an Ancient Mummy Could Be Stretched To 1.6 KM",
		"Sinai Has The Moutain In Which Prophet ( Musa ) Climb To Talk To God",
		"Egypt Have One Of The Biggest Dams In The World ( Dam Of Aswan )",
		{"title": "Rich Alphabet",
		"content": "The Old Egyptian Languague ( Hieroglyphs ) Has About 700 Symbols, That's 27 Times The Latin Alphabet"}
	],
	"resources": [
		{
			"resources": [],
			"author": "",
			"authorUrl": "",
			"from": "",
			"url": "",
			"social": [
				{"url": "","icon": ""}
			]
		},
		{
			"resources": ["Weather"],
			"url": "https://www.weatherspark.com/y/96939/Average-Weather-in-Cairo-Egypt-Year-Round"
		}
	]
}
