{
	"name": "Japan",
	"languages": ["Janpanese"],
	"theme": {
		"bg_color": "",
		"col_1": "",
		"col_2": ""
	},
	"flag": "",
	"anthem": "",
	"capital": "Tokyo",
	"population": "",
	"area": "",
	"currency" : {
		"name": "",
		"img": ""},
	"neighbours": {
		
		"north": [
			{"name": "Russia","flag": ""},
			{"name": "China", "flag": ""},
			{"name": "South Korea","flag": ""},
			{"name": "North Korea","flag": ""}
		],
		"south": [{"name": "Philippine Sea"}],
		"east":  [{"name": "Pacific Ocean"}],
		"west":  [{"name": "East China Sea"}]
	},
	"weather": {
		
		"summer": {"content": "","icons": [],"img": ""},
		"winter": {},
		"spring": {},
		"automn": {},
		"summary": ""
	},
	"art": [
	
		{
			"title": "Anime and Manga",
			"img": "",
			"content": "Manga Is The Japanese Comics, Been There For a Long Time and Been Lately Spreaded Out Into The World, Has Been The Major Part Of Japanese Publish Industry, Anime Came Later On ( Word 'Anime' Is English Short Term For Animation ) and Also Quickly Got Into The World, an Industry Consists Of Over 400 Production Companies"
		},
		{
			"title": "Theatre",
			"img": "",
			"content": ""
		},
		{
			"title": "Technology",
			"img": "",
			"content": "Known For It's Major Technology Achievements, Japan Had Been Developing In Science and Technology Since The Meiji Period Yet Gotten Into It After WW 2, Right Now Japan Advanced In Automotive Engines, Monitors, Video Games, Optical Clocks, Robotics, Natural Science, Aerospace Exploration and Biomedical Researches"
		}
	],
	"food": [
	
		{
			"title": "Buta-no-Shogayaki ( Ginger Pork )",
			"img": "",
			"content": "Most Common Dish In Japan, a Grilled Thin Slices Of Pork Dressed With a Delicate Sance Of Mirin, Soy Sauce, Sake, Granola Oil Mixed With Sliced Onions and ginger"
		},
		{
			"title": "Champon",
			"img": "",
			"content": "a Traditional Noodle Dish, Appeared In Meiji Era ( 1868 - 1912 ), Loaded With Various and Colorful Ingredients, Soaked In Warm Soup"
		},
		{
			"title": "Gyoza",
			"img": "",
			"content": "a Moon-shaped Dumplings Dish, You Could Almost Find It In Any Restaurant In Japan, The Dish Was Imported From China However Was Modified To Different Types"
		},
		{
			"title": "Dyudon",
			"img": "",
			"content": "a Bowel Of Steamed Rice Topped With Thinly Sliced Beef and Tender Onion and Served With Mirin and Soy Sauce Or Eggs ( 'Gyu' Means Beef By The Way )"
		},
		{
			"title": "Gyukatsu (Beef Cutlet)",
			"img": "",
			"content": "a Flavorful Dish Of Deep-fried Breaded Beef, Served With Cabbago, Barley Rice, Miso Soup, Potato Salad and Pickles"
		},
		{
			"title": "Karaage (Fried Chicken)",
			"img": "",
			"content": "Depending On The Area You're In It Could Be Meat Instead Of Chicken, Served With Special Spices, Coated In Flour Or Potato Stratch"
		},
		{
			"title": "Katsudon",
			"img": "",
			"content": "a Quick Delicious Meal Consist Of a Bowl Of Rice Topped With Deep-fried Pork Cutlet, Egg, Vegetables and Condiments"
		},
		{
			"title": "Onigiri (Famous Rice Ball)",
			"img": "",
			"content": "King Of The On-The-Go Food, Could Even Find In Grocery Store, Which Is a Rice Ball Flavored In Spices and Could Be Filled With Variety Of Ingredients"
		}
	],
	"landmarks": [
	
		{
			"title": "Arashiyama",
			"img": "",
			"content": "Myth Said That This Foest was Planted To Protect Surroundings Temples From Evil",
			"location": "Kyoto"
		},
		{
			"title": "Kinkaku-Ji",
			"img": "",
			"content": "Built In 1408, It Was a Zen Temple Which Was Completely Covered In Gold, Zen Temples Are For Buddhists For Meditating Maintain Inner Peace",
			"location": "Kyoto"
		},
		{
			"title": "Senso-Ji",
			"img": "",
			"content": "The Oldest Temple In all Of Japan, Was Built In 628",
			"location": "Tokyo"
		},
		{
			"title": "Moutain Fuji",
			"img": "",
			"content": "The Highest Moutain In Japan, Was an Active Volcano Which Was Last Erupted During The 18th Century, The Moutain Could Be Seen In a Clear Weather From The Capital Tokyo",
			"location": "Yamanashi"
		},
		{
			"title": "Osaka Castle",
			"img": "",
			"content": "Built In 1583, Located In The Middle of a Beautiful Park, Was Used as a Defensive System",
			"location": "Osaka Chuo Ward"
		},
		{
			"title": "Tokyo SkyTree",
			"img": "",
			"content": "Built In 2012, Is 634 Meters High, Could Have a 360 Degree View To All Japan From Up There, Considered The Second Tallest Tower In The World ( after Burj Khalifa )",
			"location": "Tokyo"
		},
		{
			"title": "Sushimi Inari Taisha",
			"img": "",
			"content": "an Important Japanese Shrine, Located In Western Kyoto and Is More Than 1000 Years Old, Dedicated To Inari Okami The God Of Agriculture",
			"location": "Kyoto"
		},
		{
			"title": "Hilltop Castle",
			"img": "",
			"content": "Built In 17th Century, a Prime Example of Ancient Japanese Castle Architecture",
			"location": "Himeji"
		},
		{
			"title": "Hiroshima Peace Park",
			"img": "",
			"content": "Built For The Memory Of Hiroshima and Nakazaki Atomic Bombs Drop In World War 2, The Park Includes a Museum",
			"location": "Hiroshima"
		}
	],
	"history": [
	
		{
			"title": "Early History",
			"content": "Back Then ( Around 3000 B.C. - 300 B.C. ) Japanese Were Farmers, Fishers and Hunters. After Than The Rice Culture Was Imported From Neighbour Countries, The Coutry Parts Were United Under Powerful Land Owners. In 250 The Country Were Finally United as One Country ( Yamato Japan), They Had an Emperor, However a Clan Called ( Soga ) Soon Gain Power Over The Emperor Himself, The Country Had Friendly Relationships With The Kingdom Of Kudara ( Korea ), Buddhism Was Introduced To Japan and Was Promoted To Ruling Class, Also The Writing System Was Imported From China as Prince ( Shotoku ) Was Promoting More and More Chinese Ideas",
			"year": "?? - 710",
			"img": ""
		},
		{
			"title": "Nara and Heian Periods",
			"content": "In 710 Japan Had a New Permenant Capital ( Nara ), However In 784 The Capital Was Moved Once More To Nagaoka and Finally To Heian( Kyoto ) In Which It Remained Capital For More Than a Thousand Years, Back Then The Fujiwara Family Controlled The Political Scene and It's Power Reached The Peak With ( Fujiwara Michinaga ) In 1016, Yet After Than Things Became Less Under Control as Land Owners Hired ( Samurai ) For Protecting Their Properties, This Is How The Military Class Became More Influent and The Fujiwara Era Was Over In 1068 With The New Emperor ( Go-Sanjo ) Was Determined To Rule The Country By Himself, The Insei Government Was The Political Power From 1068 To 1156 When ( Taira kiyomori ) Became Leader To Japan, During This Time 2 Wars Where Held First The ( Early 9 Years War ) and ( Later 3 Years War ) Between Imperial Court - Nominal Ruling Government - and Abe Clan - One Of The Oldest and Major Japanese Clans -, However This Era Was Over After Gempei War Between Thira and Minamoto Clans Which Lasted From 1180 Until 1185",
			"year": "710 - 1185",
			"img": ""
		},
		{
			"title": "Kamakura Period",
			"content": "This Period Started By The Minamoto Family Took Over Control After Gempei Wars, Minamoto Yoritomo Established a New Military Government The ( Kamakura Bakufu ) In Kamakura, By That Time The Emperor Government Was Losing Power and The ( Samurai ) Were The Leading Social Class. By The Year 1259 The Mongols Had Conquered China and Was Theating Japan, The Mongol Invasion Attempt In 1274 and The Second In 1281 Which Was Both Failed Mainly Because Of The Bad Weather. After That The Country Sinked In as Economical Problems Since Many Of The Loyal Men Who Fought For Kamakura Were Waiting For Rewards and The Government Couldn't Pay, By 1333 The Kamakura Bakufu Was Overthrowen By The Emperor ( Go-Daingo )",
			"year": "1192 - 1333",
			"img": ""
		},
		{
			"title": "Muromachi Period",
			"content": "This Era Starts With emparor ( Go-Daigo ) Restoring Imperial Power and He Had Overthrowen The Kamakuru . a Little While After ( Ashikaga Tokauji ) Once Fought For The Emperor Now Challenged The Imperial Court and Succeeded For Capturing Kyoto as He Did In 1336 and ( Go-Diago ) Fled To Yoshino, By 1338 Takauji Established His Government In Kyoto and By That Time Two Imperial Courts Were In Japan The Southern and Northern, They Fought Many Battles Against each Other, However In 1392 The Two Imperial Courts Reunited Under The Emparor. After That The ( Age Of Civil War ) Begun Between Different Parts Of Japan as It Was Destructed. In 1542 The First Portuguese Traders and Jesuit Missionaries Arrived In Kyushu, It Was When Japan Was Introduced To Fire Arms and Christianity. The Country Was In Pieces For Many Years Unitl ( Oda Nobunagu ) Managed To Take The First Steps Toward Unity By Capturing ( Kyoto ) In 1568 and Overthrowing The Muromachi Bakufu In 1573.",
			"year": "1333 - 1573",
			"img": ""
		},
		{
			"title": "Azuchi-Momoyama Period",
			"content": "Right After ( Oda Nobunaga ) Took The Capital In 1568, He Was Continuing His Elimination Over His Enemies Including The Buddhist Sects, However In 1582 General ( Akechi ) Murdered ( Nobunaga ) and Captured His Castle, He Was Also Murdered Quickly After That By ( Toyotomi Hideyoshi ) Who Had Finally Unite Japan In 1590 and He Had a CAstle Named ( Osaka ) Built In The Same Year, ( Hideyoshi ) Was Dreaming Of Conquring China, By 1592 His Armies Invaded Korea, In The Following Year However The Japanese Couldn't Hold Against Chinese and Korean So ( Hideyoshi ) Armes Draw Back In 1598 The Year Which He Died In, After That ( Tokugawa Leyasu ) Who Was an Intelligent Partner Of ( Hideyoshi ) Became The Most Powerful Man In Japan.",
			"year": "1573 - 1603",
			"img": ""
		},
		{
			"title": "Edo Period",
			"content": "as Tokugawa Make So Powerful He Wanted To Became The Absolute Ruler Of Japan, In The Battle Of ( Sekigahara ) In 1600, ( Hideyori - The Sucessor Of Hideyoshi -) Defated By Leyasu and Leyasu Was Appointed Shogun By The Emparor and Established His Government In Edo - Tokyo Now - and they Had Ruled Japan For a Remarkable 250 Years, Leyasu Continued In Promoting Foreign Trade, Making Relationships With ( English ) and ( Dutch ), On The Other Hand He Enforced The Supperssion and Persecution Of Christians From 1614, In 1615 When Leyasu Took The Osaka Castle He Had No Rivals Anymore, It Was a Peaceful Era, In 1633 Shogun ( Lemitsu ) Forbaded Travelling Aboard and Almost Completely Isolated Japan as He Regulated Trade With ( China ) and ( Netherlands ) In The Port Of ( Nagasaki ) and Babbing all Foreign Books, Yet Shortly After That a New Arts Were Made Popular Like ( Kabuki ) and ( ukiyo-e ), The Society Was Consisted Of Four Classes On Top The Samurai, Peasants, Artisans and Merchants, However a New Unofficial Class Was Formed By Those Who Had Professions That Were Considered Impure,In 1720 The Ban Of Western Literature Was Canceled and Several New Teachings Entered Japan From ( China ) and ( Europe ), After That The Country Was in an Economical Disaster, Taxes Were Going High and The Merchants Class Were Ranking Up, Things Was Turning More and More Badly For The Government as Many People Wanted a Complete Opening To The World as They Saw It as a Big Advantage and In 1868 Tokugawa Government Fell and The Power Of Emperor Meiji Was Restored.",
			"year": "1603 - 1868",
			"img": ""
		},
		{
			"title": "Meiji Period",
			"content": "When Emperor Meiji Took Over, He Moved From ( Kyoto ) To ( Tokyo ) and It Became The New Capital, The Political Power Now Moved To a Small Group Of Nobles and Former Samuraies, The New Government Aimed To Make Japan a Democratic, All The Feudal Lords Had To Return All Their Lands To The Emperor, The Education System Was Reformed After The ( French ) and Later After The ( German ), a New Army Modelled After The ( Prussian Force ) and a Navy After ( British ) Had One, Many Japanese Were Sent Aboard To Learn Science and Languages, While Foreign Experts Taught In Japan, Also a New Currency System Was Formed Besides The Bank Of Japan After a Big Financial Crisis In 1880. After That Japanese Fought The Chinese In The ( Sino-Japanese ) War Between 1894 and 1895 For an Interests In Korea and Also Fought Against Russians In The ( Russo-Japanese ) War Between 1904-1905 On Interests In Korea and Manchuria In Which They Won Both Battles. In 1912 The Emperor Meiji Died Marking and End Of an Era.",
			"year": "1868 - 1912",
			"img": ""
		},
		{
			"title": "Taisho and Early Showa Period",
			"content": "In The First World War Japan Took a Side Amoung The Allies However They Played a Minor Rule In It. The Economical Situation In Japan Gotten Worse After and The War, During The Year 1930 Military Established Almost Complete Control Over The Government, as The Navy's and Army's Officers Soon Occupied Most Of The Important Position Including The Prime Minister Rule. In 1937 The ( Second Sino-Japanese ) War Was Held, a War That Continued Until 1945 By Japanese Finally Surrendering. In Second World War Japan Joined ( German ) and ( Italy ) Side and In 1941 Japan Attacked Pearl Harbour In USA, Japan Took Control Over Large Areas, It Reached The Indian Borders, After That The U.S. Army Bombed ( Hiroshima ) and ( Nagasaki ) In August 6 and August 9 - 1945 With Atomic Bombs, (Russia) Joined The Allies Against Japan In August 8 and On August 14 Emperor Showa Decided To Surrender and They Was Forced To Give Away All The Lands They Were Accupied Since 1895 and Was Banned From Forming an Army",
			"year": "1912 - 1945",
			"img": ""
		},
		{
			"title": "Postwar",
			"content": "Japan Was Devastated After War, Industries and Trasportation were Damaged. However During The Coldwar USA Wanted to Gain Advantages Over Russians, So They Give Japanese Military Armory and Japan's Self Defense Force Established In 1954, After That Japanese Economy Begun To Grow Higher and Became The One Of The Greatest Nations In Technology.",
			"year": "1945 - Present",
			"img": ""
		}
	],
	"facts": [
		"Tokyo Is The Most Populated City With Nearly 38.14 Million People In It",
		"Japan Have a Total Sum Of 110 Active Volcanoes",
		"Each Year There Are About 1500 Earthquakes, Most Of Them are Minor Ofcourse",
		"Forests Cover 67% Of Japan",
		{
			"title": "Portugal Is The First Country to Visit Japan",
			"content": "First Besides China and Korea, It Was In 1543 Were The First Ship From Portugal Sealed To Japan, It Started The Naban Trade Era"
		},
		{
			"title": "The World Only Emperor Is In Japan",
			"content": "Japan Has an Emperor Up Til Now, Despite Having Some Power and Primarily Serves as a Symbolic Figure"
		}
	],
	"resources": [
		{
			"resources": [],
			"author": "",
			"authorUrl": "",
			"from": "",
			"url": "",
			"social": [
				{"url": "","icon": ""}
			]
		},
		{
			"resources": ["Landmarks"],
			"url": "https://www.destguides.com/en/itineraries/japan/famous-japan-landmarks"
		},
		{
			"resources": ["Facts"],
			"url": "https://www.theplanetd.com/facts-about-japan"
		}
	]
}